import classes from "./About.module.css";
import about1 from "../../assets/about-1.png";
function About() {
  return (
    <section id="about">
      <div className={classes.About}>
        <div className={classes.About__left}>
          <img src={about1} alt="aboutimg" />
        </div>
        <div className={classes.About__right}>
          <h2>О нас</h2>
          <p>
            Успешная работа на рынке сантехнических работ в Алмате позволила нам
            создать слажено работающий механизм который предоставит нашим
            клиентам следующие преимущества:
          </p>
          <ul>
            <li>оперативное выполнения работ:</li>
            <li>профессионализм монтажа ремонта и демонтажа</li>
            <li>с использованием сертифицированных деталей и инструментов.</li>
            <li>после ремонтное тестирование и наладка:</li>
            <li>грамотные консультации по вопросам сантехнических работ:</li>
            <li>гарантия на все виды работ:</li>
            <li>либеральность ценовой политики.</li>
          </ul>
          <p>
            Мы снижаем тарифы на работы и постоянно находимся в поисках
            возможностей сделать их ещё доступнее.
          </p>
          <p>
            Мы снижаем тарифы на работы и постоянно находимся в поисках
            возможностей сделать их ещё доступнее.
          </p>
        </div>
      </div>
      <div className="container">
        <div className={classes.About__item}>
          <div className={classes.About__info}>
            <h2>
              <strong>от 10 лет</strong>
            </h2>
            <p>опыт специалистов</p>
          </div>
          <div className={classes.About__info}>
            <h2>
              <strong>Быстро</strong>
            </h2>
            <p>выезд в течении 45 минут</p>
          </div>
          <div className={classes.About__info}>
            <h2>
              <strong>Kaspi Red</strong>
            </h2>
            <p>оплата в рассрочку</p>
          </div>
          <div className={classes.About__info}>
            <h2>
              <strong>от 6</strong>
            </h2>
            <p>месяцев гарантия</p>
          </div>
        </div>
        <div className={classes.About__table}>
          <div className={classes.About__table__left}>
            <div className={classes.About__tr}>
              <div className={classes.About__icon}>
                <svg
                  aria-hidden="true"
                  role="img"
                  height="1em"
                  width="1em"
                  viewBox="0 0 512 512"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    fill="currentColor"
                    d="M256 8C119 8 8 119 8 256s111 248 248 248 248-111 248-248S393 8 256 8zm0 448c-110.5 0-200-89.5-200-200S145.5 56 256 56s200 89.5 200 200-89.5 200-200 200zm61.8-104.4l-84.9-61.7c-3.1-2.3-4.9-5.9-4.9-9.7V116c0-6.6 5.4-12 12-12h32c6.6 0 12 5.4 12 12v141.7l66.8 48.6c5.4 3.9 6.5 11.4 2.6 16.8L334.6 349c-3.9 5.3-11.4 6.5-16.8 2.6z"
                  ></path>
                </svg>
              </div>
              <h5 className={classes.About__subtitle}>
                <strong>Всё делаем в чётко обозначенные сроки </strong>
              </h5>
            </div>
            <div className={classes.About__tr}>
              <div className={classes.About__icon}>
                <svg
                  aria-hidden="true"
                  role="img"
                  height="1em"
                  width="1em"
                  viewBox="0 0 448 512"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    fill="currentColor"
                    d="M323.56 51.2c-20.8 19.3-39.58 39.59-56.22 59.97C240.08 73.62 206.28 35.53 168 0 69.74 91.17 0 209.96 0 281.6 0 408.85 100.29 512 224 512s224-103.15 224-230.4c0-53.27-51.98-163.14-124.44-230.4zm-19.47 340.65C282.43 407.01 255.72 416 226.86 416 154.71 416 96 368.26 96 290.75c0-38.61 24.31-72.63 72.79-130.75 6.93 7.98 98.83 125.34 98.83 125.34l58.63-66.88c4.14 6.85 7.91 13.55 11.27 19.97 27.35 52.19 15.81 118.97-33.43 153.42z"
                  ></path>
                </svg>
              </div>
              <h5 className={classes.About__subtitle}>
                <strong>Лучшая цена</strong>
              </h5>
            </div>
            <div className={classes.About__tr}>
              <div className={classes.About__icon}>
                <svg
                  aria-hidden="true"
                  role="img"
                  height="1em"
                  width="1em"
                  viewBox="0 0 512 512"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    fill="currentColor"
                    d="M256 8C119.033 8 8 119.033 8 256s111.033 248 248 248 248-111.033 248-248S392.967 8 256 8zm0 48c110.532 0 200 89.451 200 200 0 110.532-89.451 200-200 200-110.532 0-200-89.451-200-200 0-110.532 89.451-200 200-200m140.204 130.267l-22.536-22.718c-4.667-4.705-12.265-4.736-16.97-.068L215.346 303.697l-59.792-60.277c-4.667-4.705-12.265-4.736-16.97-.069l-22.719 22.536c-4.705 4.667-4.736 12.265-.068 16.971l90.781 91.516c4.667 4.705 12.265 4.736 16.97.068l172.589-171.204c4.704-4.668 4.734-12.266.067-16.971z"
                  ></path>
                </svg>
              </div>
              <h5 className={classes.About__subtitle}>
                <strong>Предлагаем только новую продукцию</strong>
              </h5>
            </div>
          </div>
          <div className={classes.About__table__right} >
          <div className={classes.About__tr}>
            <div className={classes.About__icon}>
              <svg
                aria-hidden="true"
                role="img"
                height="1em"
                width="1em"
                viewBox="0 0 640 512"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="currentColor"
                  d="M425.7 256c-16.9 0-32.8-9-41.4-23.4L320 126l-64.2 106.6c-8.7 14.5-24.6 23.5-41.5 23.5-4.5 0-9-.6-13.3-1.9L64 215v178c0 14.7 10 27.5 24.2 31l216.2 54.1c10.2 2.5 20.9 2.5 31 0L551.8 424c14.2-3.6 24.2-16.4 24.2-31V215l-137 39.1c-4.3 1.3-8.8 1.9-13.3 1.9zm212.6-112.2L586.8 41c-3.1-6.2-9.8-9.8-16.7-8.9L320 64l91.7 152.1c3.8 6.3 11.4 9.3 18.5 7.3l197.9-56.5c9.9-2.9 14.7-13.9 10.2-23.1zM53.2 41L1.7 143.8c-4.6 9.2.3 20.2 10.1 23l197.9 56.5c7.1 2 14.7-1 18.5-7.3L320 64 69.8 32.1c-6.9-.8-13.5 2.7-16.6 8.9z"
                ></path>
              </svg>
            </div>
            <h5 className={classes.About__subtitle}>
              <strong>
                Мы купим необходимые материалы сами и доставим их до объекта
                Бесплатно
              </strong>
            </h5>
          </div>
          <div className={classes.About__tr}>
            <div className={classes.About__icon}>
              <svg
                aria-hidden="true"
                role="img"
                height="1em"
                width="1em"
                viewBox="0 0 496 512"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="currentColor"
                  d="M248 8C111 8 0 119 0 256s111 248 248 248 248-111 248-248S385 8 248 8zm0 96c48.6 0 88 39.4 88 88s-39.4 88-88 88-88-39.4-88-88 39.4-88 88-88zm0 344c-58.7 0-111.3-26.6-146.5-68.2 18.8-35.4 55.6-59.8 98.5-59.8 2.4 0 4.8.4 7.1 1.1 13 4.2 26.6 6.9 40.9 6.9 14.3 0 28-2.7 40.9-6.9 2.3-.7 4.7-1.1 7.1-1.1 42.9 0 79.7 24.4 98.5 59.8C359.3 421.4 306.7 448 248 448z"
                ></path>
              </svg>
            </div>
            <h5 className={classes.About__subtitle}>
              <strong>Не работаем с посредниками</strong>
            </h5>
          </div>

          <div className={classes.About__tr}>
            <div className={classes.About__icon}>
              <svg
                aria-hidden="true"
                role="img"
                height="1em"
                width="1em"
                viewBox="0 0 384 512"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="currentColor"
                  d="M97.12 362.63c-8.69-8.69-4.16-6.24-25.12-11.85-9.51-2.55-17.87-7.45-25.43-13.32L1.2 448.7c-4.39 10.77 3.81 22.47 15.43 22.03l52.69-2.01L105.56 507c8 8.44 22.04 5.81 26.43-4.96l52.05-127.62c-10.84 6.04-22.87 9.58-35.31 9.58-19.5 0-37.82-7.59-51.61-21.37zM382.8 448.7l-45.37-111.24c-7.56 5.88-15.92 10.77-25.43 13.32-21.07 5.64-16.45 3.18-25.12 11.85-13.79 13.78-32.12 21.37-51.62 21.37-12.44 0-24.47-3.55-35.31-9.58L252 502.04c4.39 10.77 18.44 13.4 26.43 4.96l36.25-38.28 52.69 2.01c11.62.44 19.82-11.27 15.43-22.03zM263 340c15.28-15.55 17.03-14.21 38.79-20.14 13.89-3.79 24.75-14.84 28.47-28.98 7.48-28.4 5.54-24.97 25.95-45.75 10.17-10.35 14.14-25.44 10.42-39.58-7.47-28.38-7.48-24.42 0-52.83 3.72-14.14-.25-29.23-10.42-39.58-20.41-20.78-18.47-17.36-25.95-45.75-3.72-14.14-14.58-25.19-28.47-28.98-27.88-7.61-24.52-5.62-44.95-26.41-10.17-10.35-25-14.4-38.89-10.61-27.87 7.6-23.98 7.61-51.9 0-13.89-3.79-28.72.25-38.89 10.61-20.41 20.78-17.05 18.8-44.94 26.41-13.89 3.79-24.75 14.84-28.47 28.98-7.47 28.39-5.54 24.97-25.95 45.75-10.17 10.35-14.15 25.44-10.42 39.58 7.47 28.36 7.48 24.4 0 52.82-3.72 14.14.25 29.23 10.42 39.59 20.41 20.78 18.47 17.35 25.95 45.75 3.72 14.14 14.58 25.19 28.47 28.98C104.6 325.96 106.27 325 121 340c13.23 13.47 33.84 15.88 49.74 5.82a39.676 39.676 0 0 1 42.53 0c15.89 10.06 36.5 7.65 49.73-5.82zM97.66 175.96c0-53.03 42.24-96.02 94.34-96.02s94.34 42.99 94.34 96.02-42.24 96.02-94.34 96.02-94.34-42.99-94.34-96.02z"
                ></path>
              </svg>
            </div>
            <h5 className={classes.About__subtitle}>
              <strong>Используем только качественные новые материалы</strong>
            </h5>
          </div>
          </div>
        </div>
      </div>
    </section>
  );
}

export default About;
